package org.example.learn.java.lang.spec.math.bit;

public class BitMagic02 {
    /**
     * 计算大于n的最小2的幂
     *      将最高位1及其低位都填充成1,然后再加一,通过进位得到,比最高位1更高一位是1,其低位都是0,即可获取大于n的最小2的幂
     */
    public static int SmallestPowerOfTwoMoreThan(int n) {
        if (n < 0) {
            throw new RuntimeException("不支持负数");
        }

        int t = n;      // 为了便于描述,假设最高位1的是index是i

        // 将最高位1及其后面的低位都填充成1
        t |= t >>> 1;   // 保证[i, i-1]位填充为1      如果i-1<0时,i=0, [0]位填充为1
        t |= t >>> 2;   // 保证[i, i-3]位填充为1      如果i-3<0时,i=2/1/0, [2,0]/[1,0]/[0]位填充为1
        t |= t >>> 4;   // 保证[i, i-7]位填充为1      如果i-7<0时,i=6/5/4/3/2/1/0, [6,0]/[5,0]/[4,0]/[3,0]/[2,0]/[1,0]/[0]位填充为1
        t |= t >>> 8;   // 保证最[i, i-15]位填充为1   如果i-15<0时,i=15/.../1/0, [15,0]/.../[1,0]/[0]位填充为1
        t |= t >>> 16;  // 保证[i, i-31]位填充为1     如果i-31<0时,i=30/.../1/0, [30,0]/.../[1,0]/[0]位填充为1

        // 此时t最高位1及其后面的低位都是1
        t = t + 1;     // t加一后通过进位,最高位1的更高一位是1,低位都是0  (这就可以获取大于等于n的最小2的幂)

        return t;
    }

    /**
     * 计算大于n的最小2的幂的实用价值不大. 计算大于等于n的最小2的幂使用价值更大(因为大于等于中的等于更利用控制边界).
     * 计算大于等于n的最小2的幂
     *      将最高位1的低位都填充成1,然后再加一,通过进位得到,与最高位1同位是1,其低位都是0
     */
    public static int SmallestPowerOfTwoNoLessThan(int n) {
        if (n < 0) {
            throw new RuntimeException("不支持负数");
        }

        // 将n减1,确保当n已经是2的幂时得到正确结果
        int t = (n > 1) ? n - 1 : 1;   // 关键点: 大于等于中的等于就在这里发生           | 当n>1且不为2的幂时,(n-1)与n拥有相同高的最高位1;当n>1且为2的幂时,(n-1)拥有比n低一位的最高位1,后面进位后等于n

        // 通过位运算将最高位的1之后的所有位都设为1
        t |= t >>> 1;
        t |= t >>> 2;
        t |= t >>> 4;
        t |= t >>> 8;
        t |= t >>> 16;
        // t加一后通过进位,与最高位1同位或更高一位是1,低位都是0
        t = t + 1;

        return t;
    }

    /**
     * 计算小于等于n的最大2的幂 (实用价值也比较大)
     * 只保留最高位1,其低位都填充成0,即可获取小于等于n的最大2的幂
     *
     */
    public static int maxPowerOfTwoNoMoreThan(int n) {
        if (n < 0) {
            throw new RuntimeException("不支持负数");
        }

        int t = n;
        // 先将最高位1及其后面的地位都填充成1
        t |= t >>> 1; t |= t >>> 2; t |= t >>> 4; t |= t >>> 8; t |= t >>> 16;
        // 再将低位1移除,只保留最高位1
        t = t - (t >>>1);

        return t;
    }
}
